nxp-appcodehub/dm-low-power-implementation-mcxa153/source/low_power_implementation.c
/*
 * Copyright 2022-2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "low_power_implementation.h"
#include "fsl_cmc.h"
#include "fsl_spc.h"
#include "fsl_clock.h"
#include "fsl_debug_console.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "board.h"
#include "fsl_lpuart.h"
#include "fsl_wuu.h"
#include "fsl_gpio.h"
#include "fsl_port.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define APP_POWER_MODE_NAME                                          \
    {                                                                \
        "Active", "Sleep", "DeepSleep", "PowerDown", "DeepPowerDown" \
    }

#define APP_WAKE_MODE_NAME                                          \
    {                                                               \
        "Typical wake up", "Fast wake up", "Slow wake up"           \
    }

#define APP_POWER_MODE_DESC                                                                                              \
    {                                                                                                                    \
        "Active: Core/System/Bus clock all ON.",                                                                         \
        "Sleep: CPU clock is off, and the system clock and bus clock remain ON. ",                                       \
        "Deep Sleep: Core/System/Bus clock are gated off. ",                                                             \
        "Power Down: Core/System/Bus clock are gated off, CORE domain is in static state, Flash memory is powered off",  \
        "Deep Power Down: The whole CORE domain is power gated."                                                         \
    }

#define APP_SLEEP_WAKE_DESC                                                                                              \
    {                                                                                                                    \
        "Sleep Typical wake up time: ~0.27us, Low Power current consumption: ~1.72mA",                                   \
        "Sleep Fast wake up time: ~0.14us, Low Power current consumption: ~3.31mA",                                      \
        "Sleep Slow wake up time: ~1.02us, Low Power current consumption: ~0.83mA"                                       \
    }

#define APP_DeepSleep_WAKE_DESC                                                                                          \
    {                                                                                                                    \
        "DeepSleep Typical wake up time: ~4.62us, Low Power current consumption: ~23.2uA",                               \
        "DeepSleep Fast wake up time: ~2.66us, Low Power current consumption: ~993.1uA",                                 \
        "DeepSleep Slow wake up time: ~11.94us, Low Power current consumption: ~23.2uA"                                  \
    }

#define APP_PowerDown_WAKE_DESC                                                                                          \
    {                                                                                                                    \
        "PowerDown Typical wake up time: ~10.07us, Low Power current consumption: ~6.8uA",                               \
        "PowerDown Fast wake up time: ~4.49us, Low Power current consumption: ~218.2uA",                                 \
        "PowerDown Slow wake up time: ~36.94us, Low Power current consumption: ~6.8uA"                                   \
    }

#define APP_DeepPowerDown_WAKE_DESC                                                                                      \
    {                                                                                                                    \
        "DeepPowerDown Typical wake up time: ~2.97ms, Low Power current consumption: ~1.12uA"                            \
    }

#define APP_CMC                         CMC

#define APP_SPC                         SPC0
#define APP_SPC_ISO_VALUE               (0x6U) /* VDD_USB, VDD_P2. */
#define APP_SPC_ISO_DOMAINS             "VDD_USB, VDD_P2"
#define APP_SPC_MAIN_POWER_DOMAIN       (kSPC_PowerDomain0)

#define APP_WUU                         WUU0
#define APP_WUU_WAKEUP_BUTTON_IDX       9U /* P1_7, SW3 on FRDM board. */
#define APP_WUU_WAKEUP_BUTTON_NAME      "SW3"

/* LPUART RX */
#define APP_DEBUG_CONSOLE_RX_PORT       PORT0
#define APP_DEBUG_CONSOLE_RX_GPIO       GPIO0
#define APP_DEBUG_CONSOLE_RX_PIN        2U
#define APP_DEBUG_CONSOLE_RX_PINMUX     kPORT_MuxAlt2
/* LPUART TX */
#define APP_DEBUG_CONSOLE_TX_PORT       PORT0
#define APP_DEBUG_CONSOLE_TX_GPIO       GPIO0
#define APP_DEBUG_CONSOLE_TX_PIN        3U
#define APP_DEBUG_CONSOLE_TX_PINMUX     kPORT_MuxAlt2

#define Lowpower_Test_GPIO              GPIO3
#define Lowpower_Test_GPIO_PIN          30U
/*******************************************************************************
 * Prototypes
 ******************************************************************************/
void APP_InitDebugConsole(void);
void APP_DeinitDebugConsole(void);
static void APP_SetSPCConfiguration(void);
static void APP_SetCMCConfiguration(void);

static void APP_SelectWakeupSource(void);
static void APP_GetWakeupConfig(app_power_mode_t targetMode);

static void APP_PowerPreSwitchHook(void);
static void APP_PowerPostSwitchHook(void);

static void APP_EnterSleepMode(void);
static void APP_EnterDeepSleepMode(void);
static void APP_EnterPowerDownMode(void);
static void APP_EnterDeepPowerDownMode(void);
static void APP_PowerModeSwitch(app_power_mode_t targetPowerMode);
static app_power_mode_t APP_GetTargetPowerMode(void);
static app_wakeup_mode_t APP_GetWakeUpMode(app_power_mode_t targetPowerMode);
static void APP_SetWakeUpMode(app_power_mode_t targetPowerMode, app_wakeup_mode_t targetWakeMode);
static void APP_SetSleepWakeUpMode(app_wakeup_mode_t targetWakeMode);
static void APP_SetDeepSleepWakeUpMode(app_wakeup_mode_t targetWakeMode);
static void APP_SetPowerDownWakeUpMode(app_wakeup_mode_t targetWakeMode);
static void APP_SetDeepPowerDownWakeUpMode(app_wakeup_mode_t targetWakeMode);

