nxp-appcodehub/dm-low-power-implementation-mcxa153/source/low_power_implementation.c
            PRINTF("\r\nWaiting for wake up mode select...\r\n\r\n");

            ch = GETCHAR();
            wakeUpMode = (app_wakeup_mode_t)ch;
            
            if ((wakeUpMode > kAPP_SlowWakeUp) || (wakeUpMode < kAPP_TypicalWakeUp))
            {
                PRINTF("Wrong Input!");
            }
        } while (wakeUpMode > kAPP_SlowWakeUp || wakeUpMode < kAPP_TypicalWakeUp);
    }
    else
    {
        do
        {
            PRINTF("\r\nSelect the wake up mode \n\r\n");

            for (app_wakeup_mode_t modeIndex = kAPP_TypicalWakeUp; modeIndex <= kAPP_TypicalWakeUp; modeIndex++)
            {
                PRINTF("\tPress %c to select: %s mode\r\n", modeIndex,
                       g_modeWakeArray[(uint8_t)(modeIndex - kAPP_TypicalWakeUp)]);
            }

            PRINTF("\r\nWaiting for wake up mode select...\r\n\r\n");

            ch = GETCHAR();
            wakeUpMode = (app_wakeup_mode_t)ch;
            
            if (wakeUpMode != kAPP_TypicalWakeUp)
            {
                PRINTF("Wrong Input!");
            }
        } while (wakeUpMode != kAPP_TypicalWakeUp);
    }
    PRINTF("\tPress %c and select %s mode\r\n", wakeUpMode, g_modeWakeArray[(uint8_t)(wakeUpMode - kAPP_TypicalWakeUp)]);
    switch (targetPowerMode)
    {
        case kAPP_PowerModeSleep:
            PRINTF("\t%s\n\r\n", g_SleepWakeArray[(uint8_t)(wakeUpMode - kAPP_TypicalWakeUp)]);
            break;
        case kAPP_PowerModeDeepSleep:
            PRINTF("\t%s\n\r\n", g_DeepSleepWakeArray[(uint8_t)(wakeUpMode - kAPP_TypicalWakeUp)]);
            break;
        case kAPP_PowerModePowerDown:
            PRINTF("\t%s\n\r\n", g_PowerDownWakeArray[(uint8_t)(wakeUpMode - kAPP_TypicalWakeUp)]);
            break;
        case kAPP_PowerModeDeepPowerDown:
            PRINTF("\t%s\n\r\n", g_DeepPowerDownWakeArray[(uint8_t)(wakeUpMode - kAPP_TypicalWakeUp)]);
            break;
        default:
            assert(false);
            break;
    }
    return wakeUpMode;
}

static void APP_SetWakeUpMode(app_power_mode_t targetPowerMode, app_wakeup_mode_t targetWakeMode)
{
    if (targetPowerMode != kAPP_PowerModeActive)
    {
        switch (targetPowerMode)
        {
            case kAPP_PowerModeSleep:
                APP_SetSleepWakeUpMode(targetWakeMode);
                break;
            case kAPP_PowerModeDeepSleep:
                APP_SetDeepSleepWakeUpMode(targetWakeMode);
                break;
            case kAPP_PowerModePowerDown:
                APP_SetPowerDownWakeUpMode(targetWakeMode);
                break;
            case kAPP_PowerModeDeepPowerDown:
              APP_SetDeepPowerDownWakeUpMode(targetWakeMode);
                break;
            default:
                assert(false);
                break;
        }
    }
}

static void APP_SetSleepWakeUpMode(app_wakeup_mode_t targetWakeMode)
{
      switch (targetWakeMode)
      {
          case kAPP_TypicalWakeUp:
              /* the least wake up delay */
              SPC0->LPWKUP_DELAY &= ~SPC_LPWKUP_DELAY_LPWKUP_DELAY_MASK;
              SPC0->LPWKUP_DELAY |= SPC_LPWKUP_DELAY_LPWKUP_DELAY(0x00);
              BOARD_BootClockFRO48M(kSPC_CoreLDO_MidDriveVoltage, kSPC_CoreLDO_NormalDriveStrength, 
                                    kSPC_CoreLDO_MidDriveVoltage, kSPC_CoreLDO_LowDriveStrength);
              break;
          case kAPP_FastWakeUp:
              /* the least wake up delay */
              SPC0->LPWKUP_DELAY &= ~SPC_LPWKUP_DELAY_LPWKUP_DELAY_MASK;
              SPC0->LPWKUP_DELAY |= SPC_LPWKUP_DELAY_LPWKUP_DELAY(0x00);
              BOARD_BootClockFRO96M(kSPC_CoreLDO_NormalVoltage, kSPC_CoreLDO_NormalDriveStrength, 
                                    kSPC_CoreLDO_MidDriveVoltage, kSPC_CoreLDO_LowDriveStrength);
              break;
          case kAPP_SlowWakeUp:
              /* the least wake up delay */
              SPC0->LPWKUP_DELAY &= ~SPC_LPWKUP_DELAY_LPWKUP_DELAY_MASK;
              SPC0->LPWKUP_DELAY |= SPC_LPWKUP_DELAY_LPWKUP_DELAY(0x00);
              BOARD_BootClockFRO12M(kSPC_CoreLDO_MidDriveVoltage, kSPC_CoreLDO_LowDriveStrength, 
                                    kSPC_CoreLDO_MidDriveVoltage, kSPC_CoreLDO_LowDriveStrength);
              break;
          default:
              assert(false);
              break;
      }
}

static void APP_SetDeepSleepWakeUpMode(app_wakeup_mode_t targetWakeMode)
{
      switch (targetWakeMode)
      {
          case kAPP_TypicalWakeUp:
              /* the least wake up delay */
              SPC0->LPWKUP_DELAY &= ~SPC_LPWKUP_DELAY_LPWKUP_DELAY_MASK;
              SPC0->LPWKUP_DELAY |= SPC_LPWKUP_DELAY_LPWKUP_DELAY(0x00);
              BOARD_BootClockFRO48M(kSPC_CoreLDO_MidDriveVoltage, kSPC_CoreLDO_NormalDriveStrength, 
                                    kSPC_CoreLDO_MidDriveVoltage, kSPC_CoreLDO_LowDriveStrength);
              break;
          case kAPP_FastWakeUp:
              /* the least wake up delay */
              SPC0->LPWKUP_DELAY &= ~SPC_LPWKUP_DELAY_LPWKUP_DELAY_MASK;
              SPC0->LPWKUP_DELAY |= SPC_LPWKUP_DELAY_LPWKUP_DELAY(0x00);
              /* enable FIRC and SIRC in DeepSleep mode for fast wake up */
              SCG0->FIRCCSR &= ~SCG_FIRCCSR_LK_MASK;
              SCG0->SIRCCSR &= ~SCG_SIRCCSR_LK_MASK;
              SCG0->FIRCCSR |= SCG_FIRCCSR_FIRCSTEN_MASK;
              SCG0->SIRCCSR |= SCG_SIRCCSR_SIRCSTEN_MASK;
              SCG0->FIRCCSR |= SCG_FIRCCSR_LK_MASK;
              SCG0->SIRCCSR |= SCG_SIRCCSR_LK_MASK;
              BOARD_BootClockFRO96M(kSPC_CoreLDO_NormalVoltage, kSPC_CoreLDO_NormalDriveStrength, 
                                    kSPC_CoreLDO_NormalVoltage, kSPC_CoreLDO_NormalDriveStrength);
              break;
          case kAPP_SlowWakeUp:
              /* the least wake up delay */
              SPC0->LPWKUP_DELAY &= ~SPC_LPWKUP_DELAY_LPWKUP_DELAY_MASK;
              SPC0->LPWKUP_DELAY |= SPC_LPWKUP_DELAY_LPWKUP_DELAY(0x00);
              BOARD_BootClockFRO12M(kSPC_CoreLDO_MidDriveVoltage, kSPC_CoreLDO_LowDriveStrength, 
                                    kSPC_CoreLDO_MidDriveVoltage, kSPC_CoreLDO_LowDriveStrength);
              break;
          default:
              assert(false);
              break;
      }
}

static void APP_SetPowerDownWakeUpMode(app_wakeup_mode_t targetWakeMode)
{
      switch (targetWakeMode)
      {
          case kAPP_TypicalWakeUp:
              /* Wake up delay for LDO recovery */
              SPC0->LPWKUP_DELAY &= ~SPC_LPWKUP_DELAY_LPWKUP_DELAY_MASK;
              SPC0->LPWKUP_DELAY |= SPC_LPWKUP_DELAY_LPWKUP_DELAY(0x32);
              BOARD_BootClockFRO48M(kSPC_CoreLDO_MidDriveVoltage, kSPC_CoreLDO_NormalDriveStrength, 
                                    kSPC_CoreLDO_UnderDriveVoltage, kSPC_CoreLDO_LowDriveStrength);
              break;
          case kAPP_FastWakeUp:
              /* the least wake up delay */
              SPC0->LPWKUP_DELAY &= ~SPC_LPWKUP_DELAY_LPWKUP_DELAY_MASK;
              SPC0->LPWKUP_DELAY |= SPC_LPWKUP_DELAY_LPWKUP_DELAY(0x00);
              BOARD_BootClockFRO96M(kSPC_CoreLDO_NormalVoltage, kSPC_CoreLDO_NormalDriveStrength, 
                                    kSPC_CoreLDO_NormalVoltage, kSPC_CoreLDO_NormalDriveStrength);
              break;
          case kAPP_SlowWakeUp:
              /* the longest wake up delay */
              SPC0->LPWKUP_DELAY &= ~SPC_LPWKUP_DELAY_LPWKUP_DELAY_MASK;
              SPC0->LPWKUP_DELAY |= SPC_LPWKUP_DELAY_LPWKUP_DELAY(0xFF);
              BOARD_BootClockFRO12M(kSPC_CoreLDO_MidDriveVoltage, kSPC_CoreLDO_NormalDriveStrength, 
                                    kSPC_CoreLDO_UnderDriveVoltage, kSPC_CoreLDO_LowDriveStrength);
              break;
          default:
              assert(false);
              break;
      }
}

static void APP_SetDeepPowerDownWakeUpMode(app_wakeup_mode_t targetWakeMode)
{
    switch (targetWakeMode)
    {
        case kAPP_TypicalWakeUp:
        	/* the least wake up delay */
            SPC0->LPWKUP_DELAY &= ~SPC_LPWKUP_DELAY_LPWKUP_DELAY_MASK;
            SPC0->LPWKUP_DELAY |= SPC_LPWKUP_DELAY_LPWKUP_DELAY(0x00);
            BOARD_BootClockFRO48M(kSPC_CoreLDO_MidDriveVoltage, kSPC_CoreLDO_NormalDriveStrength,
                                  kSPC_CoreLDO_MidDriveVoltage, kSPC_CoreLDO_LowDriveStrength);
            break;
        default:
            assert(false);
            break;
    }
}

static void APP_GetWakeupConfig(app_power_mode_t targetMode)
{
//    char *isoDomains = NULL;

