nxp-appcodehub/dm-low-power-implementation-mcxa153/source/low_power_implementation.c
    APP_SelectWakeupSource();

    if (targetMode > kAPP_PowerModeSleep)
    {
        /* Isolate some power domains that are not used in low power modes.*/
        SPC_SetExternalVoltageDomainsConfig(APP_SPC, APP_SPC_ISO_VALUE, 0x0U);
//        isoDomains = APP_SPC_ISO_DOMAINS;
//        PRINTF("Isolate power domains: %s\r\n", isoDomains);
    }
}

static void APP_SelectWakeupSource(void)
{
      PRINTF("Wakeup Button Selected As Wakeup Source.\r\n");
      /* Set WUU to detect on rising edge for all power modes. */
      wuu_external_wakeup_pin_config_t wakeupButtonConfig;

      wakeupButtonConfig.edge  = kWUU_ExternalPinFallingEdge;
      wakeupButtonConfig.event = kWUU_ExternalPinInterrupt;
      wakeupButtonConfig.mode  = kWUU_ExternalPinActiveAlways;
      WUU_SetExternalWakeUpPinsConfig(APP_WUU, APP_WUU_WAKEUP_BUTTON_IDX, &wakeupButtonConfig);
      PRINTF("Entering Low power mode...\r\n");
      PRINTF("Please press %s to wakeup.(Please only press the wakeup button when this message appears, otherwise it will result in failure to wake up!)\r\n", APP_WUU_WAKEUP_BUTTON_NAME);
}

static void APP_PowerPreSwitchHook(void)
{
    /* Wait for debug console output finished. */
    while (!(kLPUART_TransmissionCompleteFlag & LPUART_GetStatusFlags((LPUART_Type *)BOARD_DEBUG_UART_BASEADDR)))
    {
    }
    APP_DeinitDebugConsole();
}

static void APP_PowerPostSwitchHook(void)
{
    BOARD_BootClockFRO48M(kSPC_CoreLDO_MidDriveVoltage, kSPC_CoreLDO_NormalDriveStrength, 
                          kSPC_CoreLDO_MidDriveVoltage, kSPC_CoreLDO_LowDriveStrength);
    APP_InitDebugConsole();
}

static void APP_PowerModeSwitch(app_power_mode_t targetPowerMode)
{
    if (targetPowerMode != kAPP_PowerModeActive)
    {
        switch (targetPowerMode)
        {
            case kAPP_PowerModeSleep:
                APP_EnterSleepMode();
                break;
            case kAPP_PowerModeDeepSleep:
                APP_EnterDeepSleepMode();
                break;
            case kAPP_PowerModePowerDown:
                APP_EnterPowerDownMode();
                break;
            case kAPP_PowerModeDeepPowerDown:
                APP_EnterDeepPowerDownMode();
                break;
            default:
                assert(false);
                break;
        }
    }
}

static void APP_EnterSleepMode(void)
{
    cmc_power_domain_config_t config;

    config.clock_mode  = kCMC_GateNoneClock;
    config.main_domain = kCMC_ActiveOrSleepMode;

    CMC_EnterLowPowerMode(APP_CMC, &config);
}

static void APP_EnterDeepSleepMode(void)
{
    cmc_power_domain_config_t config;

    config.clock_mode  = kCMC_GateAllSystemClocksEnterLowPowerMode;
    config.main_domain = kCMC_DeepSleepMode;

    CMC_EnterLowPowerMode(APP_CMC, &config);
    
    SCG0->FIRCCSR &= ~SCG_FIRCCSR_LK_MASK;
    SCG0->SIRCCSR &= ~SCG_SIRCCSR_LK_MASK;
    SCG0->FIRCCSR &= ~SCG_FIRCCSR_FIRCSTEN_MASK;
    SCG0->SIRCCSR &= ~SCG_SIRCCSR_SIRCSTEN_MASK;
    SCG0->FIRCCSR |= SCG_FIRCCSR_LK_MASK;
    SCG0->SIRCCSR |= SCG_SIRCCSR_LK_MASK;
}

static void APP_EnterPowerDownMode(void)
{
    cmc_power_domain_config_t config;

    config.clock_mode  = kCMC_GateAllSystemClocksEnterLowPowerMode;
    config.main_domain = kCMC_PowerDownMode;

    CMC_EnterLowPowerMode(APP_CMC, &config);
}

static void APP_EnterDeepPowerDownMode(void)
{
    cmc_power_domain_config_t config;

    config.clock_mode  = kCMC_GateAllSystemClocksEnterLowPowerMode;
    config.main_domain = kCMC_DeepPowerDown;

    CMC_EnterLowPowerMode(APP_CMC, &config);
}
